#+TITLE: 線上學習


* TEST
** 這是一題範例
#+begin_src cpp -r -n :results output :exports both

#+end_src

* For-loop
** VPL10A: number tree
*** 程式要求說明
    輸入n，輸出一個n列的數字樹
    輸入：讀入x。
    輸出：請看範例，每行後面都要加上一個跳行符號。
*** 輸入/輸出範例
**** 輸入1
    5
**** 輸出1
    5
    44
    333
    2222
    11111
*** 想法
#+begin_src cpp -r -n :results output :exports both
#include <iostream>
using namespace std;
int main(){
    //以下的修正都基於一個前提：
    //n=5
    for (int i = 1; i <= 5; i++) {
        // 在不改外層for的前提下，完成.
        for (int j = 1; j <= 5-i; j++) {
            cout << "0";
        }
        for (int j = 1; j <= i; j++) {
            cout << 6-i;
        }
        cout << endl;
    }
}
#+end_src

#+RESULTS:
: 00005
: 00044
: 00333
: 02222
: 11111


** VPL10B: Little Star
*** 程式要求說明

    輸入n，輸出一個n列的三角形星星圖(前面空白補上 . 號)
    輸出：請看範例，每行後面都要加上一個跳行符號。

*** 輸入/輸出範例

**** 輸入1
    5
**** 輸出1
    ....*  1->4
    ...**  2->3
    ..***  3->2
    .****  4->1
    *****  5->0
           i->5-i
    請問第i列要有幾個?
** VPL10C: number tree V2.0
*** 程式要求說明

*** 輸入n，輸出一個n列的數字樹

    輸入：n。
    輸出：請看範例，每行後面都要加上一個跳行符號。

*** 輸入/輸出範例
**** 輸入1
    5
**** 輸出1
    00005
    00044
    00333
    02222
    11111
*** solution
#+begin_src cpp -r -n :results output :exports both
#include <iostream>
using namespace std;
int main() {
    cout << "test\n";
}
#+end_src

#+RESULTS:
: test

* 14A: 猜數字
0-100
| n |   甲 | 乙   |
|---+------+------|
| 0 |   37 | 85   |
| 1 |   60 | 太小 |
| 2 | 太大 | 40   |
| 3 |   80 | 太大 |
|   |      |      |

* 14B: 所有位數和
** 從第一個位數開始取
1. 12345 -> 1, 剩下 2345
2. 2345  -> 2, 剩下 345
3. ....
** 從最後一位位數開始取
1. 12345 -> 5, 剩下 1234
2. 1234  -> 4, 剩下 123

* 14C: 3n+1
1. 輸入 n
2. 印出 n
3. 如果 n = 1 結束
4. 如果 n 是奇數 那麼 n=3*n+1
5. 否則 n=n/2
6. GOTO step2
** 例
22 11 34 17 52 26 13 40 20 10 5 16 8 4 2 1 共有幾個數字(cycle length)



* 14D
輸入 1 10
1 -> cycle length: 1
2 -> cycle length: 2
3 -> cycle length: 11
4 -> cycle length: 3
5 -> cycle length: 6
6 -> cycle length: 13
7 -> cycle length: 20
8 -> cycle length: 4
9 -> cycle length: 1
10 -> cycle length: 10

#+begin_src cpp -r -n :results output :exports both
int a, b;
while (cin >> a >> b) {
    cout << a*b << endl;
}
#+end_src



* test
#+begin_src cpp -r -n :results output :exports both
#include <iostream>
using namespace std;
int main() {
    long long int a, b;
    a = 2;
    b = 4;
    if (a > b) {
        swap(a, b);
    }
    long long int sum = 0;
    for (int x = a; x <= b; x++) {
        sum += x;
        cout << x << endl;
    }
    cout << sum << endl;
}
#+end_src

#+RESULTS:
: 2
: 3
: 4
: 9
